fis-sandbox-ws/src/test/resources/payloadProfile.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://ws.sandbox.fuse.redhat.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <inc:getSubscriberProfile>
         <!--Optional:-->
         <arg0>081588888888</arg0>
      </inc:getSubscriberProfile>
   </soapenv:Body>
</soapenv:Envelope>